; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__uclibc_locale_struct.160 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.159 }
%struct.__collate_t.159 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16 }
%struct.__STDIO_FILE_STRUCT.519 = type { i16, [2 x i8], i32, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__STDIO_FILE_STRUCT.519*, [2 x i32], %struct._twoIntsStruct, i8* }
%struct._twoIntsStruct = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/tmp/klee-uclibc-130")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/tmp/klee-uclibc-130")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/tmp/klee-uclibc-130")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-13/lib/clang/13.0.1/include/stddef.h", directory: "")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !53, file: !91, line: 375, type: !330, isLocal: false, isDefinition: true)
!53 = distinct !DICompileUnit(language: DW_LANG_C99, file: !54, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !55, retainedTypes: !78, globals: !133, splitDebugInlining: false, nameTableKind: None)
!54 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/tmp/klee-uclibc-130")
!55 = !{!56, !63}
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 90, baseType: !58, size: 32, elements: !59)
!57 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/tmp/klee-uclibc-130")
!58 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!59 = !{!60, !61, !62}
!60 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0)
!61 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1)
!62 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 48, baseType: !58, size: 32, elements: !65)
!64 = !DIFile(filename: "./include/ctype.h", directory: "/tmp/klee-uclibc-130")
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!66 = !DIEnumerator(name: "_ISupper", value: 256)
!67 = !DIEnumerator(name: "_ISlower", value: 512)
!68 = !DIEnumerator(name: "_ISalpha", value: 1024)
!69 = !DIEnumerator(name: "_ISdigit", value: 2048)
!70 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!71 = !DIEnumerator(name: "_ISspace", value: 8192)
!72 = !DIEnumerator(name: "_ISprint", value: 16384)
!73 = !DIEnumerator(name: "_ISgraph", value: 32768)
!74 = !DIEnumerator(name: "_ISblank", value: 1)
!75 = !DIEnumerator(name: "_IScntrl", value: 2)
!76 = !DIEnumerator(name: "_ISpunct", value: 4)
!77 = !DIEnumerator(name: "_ISalnum", value: 8)
!78 = !{!45, !79, !7, !80, !83, !87, !82, !88, !89, !102, !110, !10}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !86)
!86 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!87 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !91, line: 400, baseType: !92)
!91 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/tmp/klee-uclibc-130")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 390, size: 128, elements: !93)
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !92, file: !91, line: 391, baseType: !85, size: 16)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !92, file: !91, line: 392, baseType: !85, size: 16, offset: 16)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !92, file: !91, line: 393, baseType: !85, size: 16, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !92, file: !91, line: 394, baseType: !85, size: 16, offset: 48)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !92, file: !91, line: 396, baseType: !85, size: 16, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !92, file: !91, line: 397, baseType: !85, size: 16, offset: 80)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !92, file: !91, line: 398, baseType: !85, size: 16, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !92, file: !91, line: 399, baseType: !85, size: 16, offset: 112)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !91, line: 430, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 425, size: 64, elements: !105)
!105 = !{!106, !107, !108, !109}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !104, file: !91, line: 426, baseType: !85, size: 16)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !104, file: !91, line: 427, baseType: !85, size: 16, offset: 16)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !104, file: !91, line: 428, baseType: !85, size: 16, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !104, file: !91, line: 429, baseType: !85, size: 16, offset: 48)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !91, line: 423, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 402, size: 304, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !112, file: !91, line: 403, baseType: !85, size: 16)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !112, file: !91, line: 404, baseType: !85, size: 16, offset: 16)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !112, file: !91, line: 405, baseType: !85, size: 16, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !112, file: !91, line: 406, baseType: !85, size: 16, offset: 48)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !112, file: !91, line: 407, baseType: !85, size: 16, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !112, file: !91, line: 408, baseType: !85, size: 16, offset: 80)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !112, file: !91, line: 409, baseType: !85, size: 16, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !112, file: !91, line: 410, baseType: !85, size: 16, offset: 112)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !112, file: !91, line: 411, baseType: !85, size: 16, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !112, file: !91, line: 412, baseType: !85, size: 16, offset: 144)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !112, file: !91, line: 413, baseType: !85, size: 16, offset: 160)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !112, file: !91, line: 414, baseType: !85, size: 16, offset: 176)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !112, file: !91, line: 415, baseType: !85, size: 16, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !112, file: !91, line: 416, baseType: !85, size: 16, offset: 208)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !112, file: !91, line: 418, baseType: !85, size: 16, offset: 224)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !112, file: !91, line: 419, baseType: !85, size: 16, offset: 240)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !112, file: !91, line: 420, baseType: !85, size: 16, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !112, file: !91, line: 421, baseType: !85, size: 16, offset: 272)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !112, file: !91, line: 422, baseType: !85, size: 16, offset: 288)
!133 = !{!134, !318, !51, !320, !323, !325}
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "__global_locale", scope: !53, file: !91, line: 377, type: !136, isLocal: false, isDefinition: true)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !57, line: 330, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !57, line: 154, size: 26560, elements: !139)
!139 = !{!140, !147, !153, !154, !158, !160, !161, !165, !169, !171, !172, !173, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !192, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !138, file: !57, line: 156, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !144, line: 38, baseType: !145)
!144 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/tmp/klee-uclibc-130")
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !146, line: 44, baseType: !86)
!146 = !DIFile(filename: "./include/bits/types.h", directory: "/tmp/klee-uclibc-130")
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !138, file: !57, line: 157, baseType: !148, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !144, line: 42, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !146, line: 43, baseType: !152)
!152 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !138, file: !57, line: 158, baseType: !148, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !138, file: !57, line: 162, baseType: !155, size: 6144, offset: 192)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 6144, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 384)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !138, file: !57, line: 163, baseType: !159, size: 6144, offset: 6336)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 6144, elements: !156)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !138, file: !57, line: 164, baseType: !159, size: 6144, offset: 12480)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !138, file: !57, line: 168, baseType: !162, size: 112, offset: 18624)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 112, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 14)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !138, file: !57, line: 174, baseType: !166, size: 96, offset: 18736)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 96, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 6)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !138, file: !57, line: 175, baseType: !170, size: 48, offset: 18832)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 48, elements: !167)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !138, file: !57, line: 178, baseType: !82, size: 8, offset: 18880)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !138, file: !57, line: 179, baseType: !82, size: 8, offset: 18888)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !138, file: !57, line: 180, baseType: !174, size: 80, offset: 18896)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 80, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 10)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !138, file: !57, line: 183, baseType: !80, size: 64, offset: 19008)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !138, file: !57, line: 184, baseType: !80, size: 64, offset: 19072)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !138, file: !57, line: 185, baseType: !80, size: 64, offset: 19136)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !138, file: !57, line: 186, baseType: !80, size: 64, offset: 19200)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !138, file: !57, line: 188, baseType: !80, size: 64, offset: 19264)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !138, file: !57, line: 189, baseType: !83, size: 64, offset: 19328)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !138, file: !57, line: 190, baseType: !80, size: 64, offset: 19392)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !138, file: !57, line: 191, baseType: !80, size: 64, offset: 19456)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !138, file: !57, line: 197, baseType: !83, size: 64, offset: 19520)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !138, file: !57, line: 199, baseType: !80, size: 64, offset: 19584)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !138, file: !57, line: 200, baseType: !80, size: 64, offset: 19648)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !138, file: !57, line: 202, baseType: !189, size: 64, offset: 19712)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !152)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !138, file: !57, line: 205, baseType: !193, size: 32, offset: 19776)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !138, file: !57, line: 206, baseType: !193, size: 32, offset: 19808)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !138, file: !57, line: 207, baseType: !45, size: 32, offset: 19840)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !138, file: !57, line: 208, baseType: !45, size: 32, offset: 19872)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !138, file: !57, line: 213, baseType: !29, size: 64, offset: 19904)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !138, file: !57, line: 214, baseType: !29, size: 64, offset: 19968)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !138, file: !57, line: 215, baseType: !29, size: 64, offset: 20032)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !138, file: !57, line: 216, baseType: !29, size: 64, offset: 20096)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !138, file: !57, line: 217, baseType: !29, size: 64, offset: 20160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !138, file: !57, line: 218, baseType: !29, size: 64, offset: 20224)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !138, file: !57, line: 219, baseType: !29, size: 64, offset: 20288)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !138, file: !57, line: 220, baseType: !29, size: 64, offset: 20352)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !138, file: !57, line: 221, baseType: !29, size: 64, offset: 20416)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !138, file: !57, line: 222, baseType: !29, size: 64, offset: 20480)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !138, file: !57, line: 223, baseType: !29, size: 64, offset: 20544)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !138, file: !57, line: 226, baseType: !29, size: 64, offset: 20608)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !138, file: !57, line: 227, baseType: !29, size: 64, offset: 20672)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !138, file: !57, line: 228, baseType: !29, size: 64, offset: 20736)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !138, file: !57, line: 231, baseType: !29, size: 64, offset: 20800)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !138, file: !57, line: 232, baseType: !29, size: 64, offset: 20864)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !138, file: !57, line: 233, baseType: !29, size: 64, offset: 20928)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !138, file: !57, line: 234, baseType: !29, size: 64, offset: 20992)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !138, file: !57, line: 235, baseType: !29, size: 64, offset: 21056)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !138, file: !57, line: 236, baseType: !29, size: 64, offset: 21120)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !138, file: !57, line: 237, baseType: !29, size: 64, offset: 21184)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !138, file: !57, line: 238, baseType: !29, size: 64, offset: 21248)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !138, file: !57, line: 239, baseType: !29, size: 64, offset: 21312)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !138, file: !57, line: 240, baseType: !29, size: 64, offset: 21376)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !138, file: !57, line: 241, baseType: !29, size: 64, offset: 21440)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !138, file: !57, line: 242, baseType: !29, size: 64, offset: 21504)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !138, file: !57, line: 243, baseType: !29, size: 64, offset: 21568)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !138, file: !57, line: 244, baseType: !29, size: 64, offset: 21632)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !138, file: !57, line: 245, baseType: !29, size: 64, offset: 21696)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !138, file: !57, line: 246, baseType: !29, size: 64, offset: 21760)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !138, file: !57, line: 247, baseType: !29, size: 64, offset: 21824)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !138, file: !57, line: 248, baseType: !29, size: 64, offset: 21888)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !138, file: !57, line: 249, baseType: !29, size: 64, offset: 21952)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !138, file: !57, line: 250, baseType: !29, size: 64, offset: 22016)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !138, file: !57, line: 251, baseType: !29, size: 64, offset: 22080)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !138, file: !57, line: 253, baseType: !29, size: 64, offset: 22144)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !138, file: !57, line: 256, baseType: !29, size: 64, offset: 22208)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !138, file: !57, line: 257, baseType: !29, size: 64, offset: 22272)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !138, file: !57, line: 258, baseType: !29, size: 64, offset: 22336)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !138, file: !57, line: 259, baseType: !29, size: 64, offset: 22400)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !138, file: !57, line: 260, baseType: !29, size: 64, offset: 22464)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !138, file: !57, line: 261, baseType: !29, size: 64, offset: 22528)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !138, file: !57, line: 262, baseType: !29, size: 64, offset: 22592)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !138, file: !57, line: 264, baseType: !29, size: 64, offset: 22656)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !138, file: !57, line: 265, baseType: !29, size: 64, offset: 22720)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !138, file: !57, line: 266, baseType: !29, size: 64, offset: 22784)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !138, file: !57, line: 267, baseType: !29, size: 64, offset: 22848)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !138, file: !57, line: 268, baseType: !29, size: 64, offset: 22912)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !138, file: !57, line: 269, baseType: !29, size: 64, offset: 22976)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !138, file: !57, line: 270, baseType: !29, size: 64, offset: 23040)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !138, file: !57, line: 272, baseType: !29, size: 64, offset: 23104)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !138, file: !57, line: 273, baseType: !29, size: 64, offset: 23168)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !138, file: !57, line: 274, baseType: !29, size: 64, offset: 23232)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !138, file: !57, line: 275, baseType: !29, size: 64, offset: 23296)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !138, file: !57, line: 276, baseType: !29, size: 64, offset: 23360)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !138, file: !57, line: 277, baseType: !29, size: 64, offset: 23424)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !138, file: !57, line: 278, baseType: !29, size: 64, offset: 23488)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !138, file: !57, line: 279, baseType: !29, size: 64, offset: 23552)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !138, file: !57, line: 280, baseType: !29, size: 64, offset: 23616)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !138, file: !57, line: 281, baseType: !29, size: 64, offset: 23680)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !138, file: !57, line: 282, baseType: !29, size: 64, offset: 23744)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !138, file: !57, line: 283, baseType: !29, size: 64, offset: 23808)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !138, file: !57, line: 285, baseType: !29, size: 64, offset: 23872)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !138, file: !57, line: 286, baseType: !29, size: 64, offset: 23936)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !138, file: !57, line: 287, baseType: !29, size: 64, offset: 24000)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !138, file: !57, line: 288, baseType: !29, size: 64, offset: 24064)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !138, file: !57, line: 289, baseType: !29, size: 64, offset: 24128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !138, file: !57, line: 290, baseType: !29, size: 64, offset: 24192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !138, file: !57, line: 291, baseType: !29, size: 64, offset: 24256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !138, file: !57, line: 292, baseType: !29, size: 64, offset: 24320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !138, file: !57, line: 293, baseType: !29, size: 64, offset: 24384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !138, file: !57, line: 294, baseType: !29, size: 64, offset: 24448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !138, file: !57, line: 295, baseType: !29, size: 64, offset: 24512)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !138, file: !57, line: 296, baseType: !29, size: 64, offset: 24576)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !138, file: !57, line: 298, baseType: !29, size: 64, offset: 24640)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !138, file: !57, line: 299, baseType: !29, size: 64, offset: 24704)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !138, file: !57, line: 301, baseType: !29, size: 64, offset: 24768)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !138, file: !57, line: 302, baseType: !29, size: 64, offset: 24832)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !138, file: !57, line: 303, baseType: !29, size: 64, offset: 24896)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !138, file: !57, line: 304, baseType: !29, size: 64, offset: 24960)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !138, file: !57, line: 305, baseType: !29, size: 64, offset: 25024)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !138, file: !57, line: 307, baseType: !29, size: 64, offset: 25088)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !138, file: !57, line: 308, baseType: !29, size: 64, offset: 25152)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !138, file: !57, line: 309, baseType: !29, size: 64, offset: 25216)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !138, file: !57, line: 310, baseType: !29, size: 64, offset: 25280)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !138, file: !57, line: 311, baseType: !29, size: 64, offset: 25344)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !138, file: !57, line: 316, baseType: !29, size: 64, offset: 25408)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !138, file: !57, line: 317, baseType: !29, size: 64, offset: 25472)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !138, file: !57, line: 318, baseType: !29, size: 64, offset: 25536)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !138, file: !57, line: 319, baseType: !29, size: 64, offset: 25600)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !138, file: !57, line: 322, baseType: !288, size: 896, offset: 25664)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !57, line: 149, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 111, size: 896, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !316, !317}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !289, file: !57, line: 112, baseType: !85, size: 16)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !289, file: !57, line: 113, baseType: !85, size: 16, offset: 16)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !289, file: !57, line: 114, baseType: !85, size: 16, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !289, file: !57, line: 115, baseType: !85, size: 16, offset: 48)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !289, file: !57, line: 116, baseType: !85, size: 16, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !289, file: !57, line: 117, baseType: !85, size: 16, offset: 80)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !289, file: !57, line: 118, baseType: !85, size: 16, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !289, file: !57, line: 119, baseType: !85, size: 16, offset: 112)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !289, file: !57, line: 120, baseType: !85, size: 16, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !289, file: !57, line: 121, baseType: !85, size: 16, offset: 144)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !289, file: !57, line: 122, baseType: !85, size: 16, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !289, file: !57, line: 123, baseType: !85, size: 16, offset: 176)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !289, file: !57, line: 124, baseType: !85, size: 16, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !289, file: !57, line: 125, baseType: !85, size: 16, offset: 208)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !289, file: !57, line: 127, baseType: !85, size: 16, offset: 224)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !289, file: !57, line: 128, baseType: !85, size: 16, offset: 240)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !289, file: !57, line: 130, baseType: !83, size: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !289, file: !57, line: 131, baseType: !83, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !289, file: !57, line: 132, baseType: !83, size: 64, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !289, file: !57, line: 135, baseType: !83, size: 64, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !289, file: !57, line: 138, baseType: !83, size: 64, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !289, file: !57, line: 141, baseType: !83, size: 64, offset: 576)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !289, file: !57, line: 142, baseType: !83, size: 64, offset: 640)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !289, file: !57, line: 145, baseType: !315, size: 64, offset: 704)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !289, file: !57, line: 146, baseType: !315, size: 64, offset: 768)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !289, file: !57, line: 148, baseType: !85, size: 16, offset: 832)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !53, file: !91, line: 380, type: !136, isLocal: false, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "utf8", scope: !53, file: !91, line: 387, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !167)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "ascii", scope: !53, file: !91, line: 388, type: !322, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "__code2flag", scope: !53, file: !91, line: 854, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 256, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 16)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !57, line: 324, baseType: !138)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !333, file: !334, line: 131, type: !378, isLocal: true, isDefinition: true)
!333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !334, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !335, splitDebugInlining: false, nameTableKind: None)
!334 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/tmp/klee-uclibc-130")
!335 = !{!336, !368, !370, !372, !374, !376, !331}
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "stdin", scope: !333, file: !334, line: 154, type: !338, isLocal: false, isDefinition: true)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !340, line: 46, baseType: !341)
!340 = !DIFile(filename: "./include/stdio.h", directory: "/tmp/klee-uclibc-130")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !342, line: 233, size: 704, elements: !343)
!342 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/tmp/klee-uclibc-130")
!343 = !{!344, !345, !349, !350, !351, !352, !353, !354, !355, !356, !358, !360, !367}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !341, file: !342, line: 234, baseType: !86, size: 16)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !341, file: !342, line: 237, baseType: !346, size: 16, offset: 16)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 16, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 2)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !341, file: !342, line: 244, baseType: !45, size: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !341, file: !342, line: 246, baseType: !88, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !341, file: !342, line: 247, baseType: !88, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !341, file: !342, line: 248, baseType: !88, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !341, file: !342, line: 249, baseType: !88, size: 64, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !341, file: !342, line: 252, baseType: !88, size: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !341, file: !342, line: 255, baseType: !88, size: 64, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !341, file: !342, line: 261, baseType: !357, size: 64, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !341, file: !342, line: 268, baseType: !359, size: 64, offset: 512)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 64, elements: !347)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !341, file: !342, line: 271, baseType: !361, size: 64, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !362, line: 85, baseType: !363)
!362 = !DIFile(filename: "./include/wchar.h", directory: "/tmp/klee-uclibc-130")
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !362, line: 81, size: 64, elements: !364)
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !363, file: !362, line: 83, baseType: !193, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !363, file: !362, line: 84, baseType: !193, size: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !341, file: !342, line: 274, baseType: !6, size: 64, offset: 640)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "stdout", scope: !333, file: !334, line: 155, type: !338, isLocal: false, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "stderr", scope: !333, file: !334, line: 156, type: !338, isLocal: false, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "__stdin", scope: !333, file: !334, line: 159, type: !338, isLocal: false, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "__stdout", scope: !333, file: !334, line: 162, type: !338, isLocal: false, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !333, file: !334, line: 180, type: !338, isLocal: false, isDefinition: true)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 2112, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 3)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !383, file: !384, line: 49, type: !45, isLocal: true, isDefinition: true)
!383 = distinct !DICompileUnit(language: DW_LANG_C99, file: !384, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !385, globals: !399, splitDebugInlining: false, nameTableKind: None)
!384 = !DIFile(filename: "libc/stdlib/abort.c", directory: "/tmp/klee-uclibc-130")
!385 = !{!386, !6, !395}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !388, line: 50, baseType: !389)
!388 = !DIFile(filename: "./include/signal.h", directory: "/tmp/klee-uclibc-130")
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !390, line: 31, baseType: !391)
!390 = !DIFile(filename: "./include/bits/sigset.h", directory: "/tmp/klee-uclibc-130")
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !390, line: 28, size: 1024, elements: !392)
!392 = !{!393}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !391, file: !390, line: 30, baseType: !394, size: 1024)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, elements: !328)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !388, line: 75, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !45}
!399 = !{!381}
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "__exit_cleanup", scope: !402, file: !405, line: 309, type: !396, isLocal: false, isDefinition: true)
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !404, splitDebugInlining: false, nameTableKind: None)
!403 = !DIFile(filename: "libc/stdlib/exit.c", directory: "/tmp/klee-uclibc-130")
!404 = !{!400}
!405 = !DIFile(filename: "libc/stdlib/_atexit.c", directory: "/tmp/klee-uclibc-130")
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "locale_mmap", scope: !408, file: !409, line: 11, type: !414, isLocal: true, isDefinition: true)
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !410, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "extra/locale/locale_data.c", directory: "/tmp/klee-uclibc-130")
!410 = !{!411, !406}
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "__locale_mmap", scope: !408, file: !409, line: 20149, type: !413, isLocal: false, isDefinition: true)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_mmap_t", file: !416, line: 91, baseType: !417)
!416 = !DIFile(filename: "./extra/locale/locale_mmap.h", directory: "/tmp/klee-uclibc-130")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 31, size: 2047232, elements: !418)
!418 = !{!419, !423, !427, !431, !435, !439, !443, !447, !451, !455, !459, !463, !467, !484, !488, !490, !492, !496, !498, !502, !506, !510, !514, !518, !522, !526, !530, !534, !538, !542, !543, !547, !551, !555, !559, !563}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !417, file: !416, line: 37, baseType: !420, size: 3360)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 3360, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 420)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !417, file: !416, line: 38, baseType: !424, size: 4032, offset: 3360)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 4032, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 504)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !417, file: !416, line: 40, baseType: !428, size: 28160, offset: 7392)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 28160, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 1760)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !417, file: !416, line: 41, baseType: !432, size: 36224, offset: 35552)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 36224, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 4528)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !417, file: !416, line: 46, baseType: !436, size: 28832, offset: 71776)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 28832, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 3604)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !417, file: !416, line: 47, baseType: !440, size: 13440, offset: 100608)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 13440, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 1680)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !417, file: !416, line: 48, baseType: !444, size: 3136, offset: 114048)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 3136, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 196)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_data", scope: !417, file: !416, line: 53, baseType: !448, size: 408, offset: 117184)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 408, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 51)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_data", scope: !417, file: !416, line: 54, baseType: !452, size: 224, offset: 117592)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 224, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 28)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_data", scope: !417, file: !416, line: 55, baseType: !456, size: 13168, offset: 117816)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 13168, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 1646)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_data", scope: !417, file: !416, line: 56, baseType: !460, size: 226824, offset: 130984)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 226824, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 28353)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_data", scope: !417, file: !416, line: 58, baseType: !464, size: 14432, offset: 357808)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 14432, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 1804)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_8_bit", scope: !417, file: !416, line: 62, baseType: !468, size: 15824, offset: 372240)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 15824, elements: !482)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "__codeset_8_bit_t", file: !471, line: 21, baseType: !472)
!471 = !DIFile(filename: "./extra/locale/c8tables.h", directory: "/tmp/klee-uclibc-130")
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 16, size: 688, elements: !473)
!473 = !{!474, !476, !477, !478}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !472, file: !471, line: 17, baseType: !475, size: 128)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 128, elements: !328)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !472, file: !471, line: 18, baseType: !475, size: 128, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !472, file: !471, line: 19, baseType: !475, size: 128, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !472, file: !471, line: 20, baseType: !479, size: 304, offset: 384)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 304, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 38)
!482 = !{!483}
!483 = !DISubrange(count: 23)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_rows", scope: !417, file: !416, line: 65, baseType: !485, size: 160, offset: 388064)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 160, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 20)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_offsets", scope: !417, file: !416, line: 65, baseType: !489, size: 160, offset: 388224)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 160, elements: !175)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_idx", scope: !417, file: !416, line: 65, baseType: !491, size: 320, offset: 388384)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 320, elements: !486)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_rows", scope: !417, file: !416, line: 66, baseType: !493, size: 360, offset: 388704)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 360, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 45)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_offsets", scope: !417, file: !416, line: 66, baseType: !497, size: 48, offset: 389072)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 48, elements: !379)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_idx", scope: !417, file: !416, line: 66, baseType: !499, size: 240, offset: 389120)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 240, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 15)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_rows", scope: !417, file: !416, line: 67, baseType: !503, size: 31152, offset: 389360)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 31152, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 3894)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_offsets", scope: !417, file: !416, line: 67, baseType: !507, size: 352, offset: 420512)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 352, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 22)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_idx", scope: !417, file: !416, line: 67, baseType: !511, size: 6512, offset: 420864)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 6512, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 407)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_rows", scope: !417, file: !416, line: 68, baseType: !515, size: 66000, offset: 427376)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 66000, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 8250)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_offsets", scope: !417, file: !416, line: 68, baseType: !519, size: 800, offset: 493376)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 800, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 50)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_idx", scope: !417, file: !416, line: 68, baseType: !523, size: 54864, offset: 494176)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 54864, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 3429)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_rows", scope: !417, file: !416, line: 70, baseType: !527, size: 2976, offset: 549040)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 2976, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 372)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_offsets", scope: !417, file: !416, line: 70, baseType: !531, size: 64, offset: 552016)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 64, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 4)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_idx", scope: !417, file: !416, line: 70, baseType: !535, size: 3200, offset: 552080)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 3200, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 200)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "collate_data", scope: !417, file: !416, line: 72, baseType: !539, size: 1458256, offset: 555280)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 1458256, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 91141)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_item_offsets_LEN", scope: !417, file: !416, line: 74, baseType: !170, size: 48, offset: 2013536)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_tbl_offsets", scope: !417, file: !416, line: 75, baseType: !544, size: 1536, offset: 2013632)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1536, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 24)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "locales", scope: !417, file: !416, line: 80, baseType: !548, size: 22608, offset: 2015168)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 22608, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 2826)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "locale_names5", scope: !417, file: !416, line: 81, baseType: !552, size: 6680, offset: 2037776)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 6680, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 835)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "locale_at_modifiers", scope: !417, file: !416, line: 82, baseType: !556, size: 144, offset: 2044456)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 144, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 18)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "lc_names", scope: !417, file: !416, line: 85, baseType: !560, size: 552, offset: 2044600)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 552, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 69)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_list", scope: !417, file: !416, line: 87, baseType: !564, size: 2040, offset: 2045152)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 2040, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 255)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "__C_ctype_b_data", scope: !569, file: !574, line: 471, type: !575, isLocal: false, isDefinition: true)
!569 = distinct !DICompileUnit(language: DW_LANG_C99, file: !570, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !571, splitDebugInlining: false, nameTableKind: None)
!570 = !DIFile(filename: "libc/misc/ctype/__C_ctype_b.c", directory: "/tmp/klee-uclibc-130")
!571 = !{!567, !572}
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "__C_ctype_b", scope: !569, file: !574, line: 862, type: !141, isLocal: false, isDefinition: true)
!574 = !DIFile(filename: "libc/misc/ctype/ctype.c", directory: "/tmp/klee-uclibc-130")
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 6144, elements: !156)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "__C_ctype_tolower_data", scope: !578, file: !574, line: 878, type: !583, isLocal: false, isDefinition: true)
!578 = distinct !DICompileUnit(language: DW_LANG_C99, file: !579, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !580, splitDebugInlining: false, nameTableKind: None)
!579 = !DIFile(filename: "libc/misc/ctype/__C_ctype_tolower.c", directory: "/tmp/klee-uclibc-130")
!580 = !{!576, !581}
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "__C_ctype_tolower", scope: !578, file: !574, line: 981, type: !148, isLocal: false, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 6144, elements: !156)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "__C_ctype_toupper_data", scope: !586, file: !574, line: 1000, type: !583, isLocal: false, isDefinition: true)
!586 = distinct !DICompileUnit(language: DW_LANG_C99, file: !587, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !588, splitDebugInlining: false, nameTableKind: None)
!587 = !DIFile(filename: "libc/misc/ctype/__C_ctype_toupper.c", directory: "/tmp/klee-uclibc-130")
!588 = !{!584, !589}
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "__C_ctype_toupper", scope: !586, file: !574, line: 1103, type: !148, isLocal: false, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "h_errno", scope: !593, file: !594, line: 8, type: !45, isLocal: false, isDefinition: true)
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !594, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !595, splitDebugInlining: false, nameTableKind: None)
!594 = !DIFile(filename: "libc/misc/internals/errno.c", directory: "/tmp/klee-uclibc-130")
!595 = !{!596, !591}
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "errno", scope: !593, file: !594, line: 7, type: !45, isLocal: false, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "spec_base", scope: !600, file: !601, line: 1441, type: !740, isLocal: true, isDefinition: true)
!600 = distinct !DISubprogram(name: "_do_one_spec", scope: !601, file: !601, line: 1438, type: !602, scopeLine: 1440, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !680, retainedNodes: !4)
!601 = !DIFile(filename: "libc/stdio/_vfprintf.c", directory: "/tmp/klee-uclibc-130")
!602 = !DISubroutineType(types: !603)
!603 = !{!45, !604, !628, !679}
!604 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !340, line: 46, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !342, line: 233, size: 704, elements: !608)
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !620, !621, !627}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !607, file: !342, line: 234, baseType: !86, size: 16)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !607, file: !342, line: 237, baseType: !346, size: 16, offset: 16)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !607, file: !342, line: 244, baseType: !45, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !607, file: !342, line: 246, baseType: !88, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !607, file: !342, line: 247, baseType: !88, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !607, file: !342, line: 248, baseType: !88, size: 64, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !607, file: !342, line: 249, baseType: !88, size: 64, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !607, file: !342, line: 252, baseType: !88, size: 64, offset: 320)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !607, file: !342, line: 255, baseType: !88, size: 64, offset: 384)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !607, file: !342, line: 261, baseType: !619, size: 64, offset: 448)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !607, file: !342, line: 268, baseType: !359, size: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !607, file: !342, line: 271, baseType: !622, size: 64, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !362, line: 85, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !362, line: 81, size: 64, elements: !624)
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !623, file: !362, line: 83, baseType: !193, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !623, file: !362, line: 84, baseType: !193, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !607, file: !342, line: 274, baseType: !6, size: 64, offset: 640)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ppfs_t", file: !601, line: 419, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !601, line: 400, size: 2048, elements: !631)
!631 = !{!632, !633, !642, !643, !644, !645, !647, !651, !665}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "fmtpos", scope: !630, file: !601, line: 401, baseType: !29, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !630, file: !601, line: 402, baseType: !634, size: 160, offset: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "printf_info", file: !635, line: 55, size: 160, elements: !636)
!635 = !DIFile(filename: "./include/printf.h", directory: "/tmp/klee-uclibc-130")
!636 = !{!637, !638, !639, !640, !641}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !634, file: !635, line: 57, baseType: !45, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !634, file: !635, line: 58, baseType: !45, size: 32, offset: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !634, file: !635, line: 60, baseType: !193, size: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !634, file: !635, line: 107, baseType: !58, size: 32, offset: 96)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !634, file: !635, line: 141, baseType: !193, size: 32, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "maxposarg", scope: !630, file: !601, line: 404, baseType: !45, size: 32, offset: 224)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "num_data_args", scope: !630, file: !601, line: 406, baseType: !45, size: 32, offset: 256)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "conv_num", scope: !630, file: !601, line: 407, baseType: !58, size: 32, offset: 288)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "argnumber", scope: !630, file: !601, line: 408, baseType: !646, size: 32, offset: 320)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 32, elements: !532)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "argtype", scope: !630, file: !601, line: 409, baseType: !648, size: 288, offset: 352)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 288, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 9)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !630, file: !601, line: 410, baseType: !652, size: 192, offset: 640)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !653, line: 14, baseType: !654)
!653 = !DIFile(filename: "/usr/lib/llvm-13/lib/clang/13.0.1/include/stdarg.h", directory: "")
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !655, baseType: !656)
!655 = !DIFile(filename: "libc/stdio/vfprintf.c", directory: "/tmp/klee-uclibc-130")
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 192, elements: !663)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !658)
!658 = !{!659, !660, !661, !662}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !657, file: !655, baseType: !58, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !657, file: !655, baseType: !58, size: 32, offset: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !657, file: !655, baseType: !6, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !657, file: !655, baseType: !6, size: 64, offset: 128)
!663 = !{!664}
!664 = !DISubrange(count: 1)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "argvalue", scope: !630, file: !601, line: 417, baseType: !666, size: 1152, offset: 896)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 1152, elements: !649)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "argvalue_t", file: !601, line: 394, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !601, line: 382, size: 128, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !676, !678}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "wc", scope: !668, file: !601, line: 383, baseType: !193, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !668, file: !601, line: 384, baseType: !58, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ul", scope: !668, file: !601, line: 385, baseType: !10, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ull", scope: !668, file: !601, line: 387, baseType: !25, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !668, file: !601, line: 390, baseType: !675, size: 64)
!675 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ld", scope: !668, file: !601, line: 391, baseType: !677, size: 128)
!677 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !668, file: !601, line: 393, baseType: !6, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!680 = distinct !DICompileUnit(language: DW_LANG_C99, file: !655, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !681, retainedTypes: !720, globals: !734, splitDebugInlining: false, nameTableKind: None)
!681 = !{!682, !690, !713}
!682 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !600, file: !601, line: 1448, baseType: !58, size: 32, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689}
!684 = !DIEnumerator(name: "PREFIX_PLUS", value: 0)
!685 = !DIEnumerator(name: "PREFIX_MINUS", value: 2)
!686 = !DIEnumerator(name: "PREFIX_SPACE", value: 4)
!687 = !DIEnumerator(name: "PREFIX_LWR_X", value: 6)
!688 = !DIEnumerator(name: "PREFIX_UPR_X", value: 9)
!689 = !DIEnumerator(name: "PREFIX_NONE", value: 11)
!690 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !601, line: 252, baseType: !58, size: 32, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712}
!692 = !DIEnumerator(name: "CONV_n", value: 0)
!693 = !DIEnumerator(name: "CONV_p", value: 1)
!694 = !DIEnumerator(name: "CONV_x", value: 2)
!695 = !DIEnumerator(name: "CONV_X", value: 3)
!696 = !DIEnumerator(name: "CONV_o", value: 4)
!697 = !DIEnumerator(name: "CONV_u", value: 5)
!698 = !DIEnumerator(name: "CONV_d", value: 6)
!699 = !DIEnumerator(name: "CONV_i", value: 7)
!700 = !DIEnumerator(name: "CONV_f", value: 8)
!701 = !DIEnumerator(name: "CONV_F", value: 9)
!702 = !DIEnumerator(name: "CONV_e", value: 10)
!703 = !DIEnumerator(name: "CONV_E", value: 11)
!704 = !DIEnumerator(name: "CONV_g", value: 12)
!705 = !DIEnumerator(name: "CONV_G", value: 13)
!706 = !DIEnumerator(name: "CONV_a", value: 14)
!707 = !DIEnumerator(name: "CONV_A", value: 15)
!708 = !DIEnumerator(name: "CONV_C", value: 16)
!709 = !DIEnumerator(name: "CONV_S", value: 17)
!710 = !DIEnumerator(name: "CONV_c", value: 18)
!711 = !DIEnumerator(name: "CONV_s", value: 19)
!712 = !DIEnumerator(name: "CONV_custom0", value: 20)
!713 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !714, line: 79, baseType: !58, size: 32, elements: !715)
!714 = !DIFile(filename: "./include/bits/uClibc_uintmaxtostr.h", directory: "/tmp/klee-uclibc-130")
!715 = !{!716, !717, !718, !719}
!716 = !DIEnumerator(name: "__UIM_DECIMAL", value: 0)
!717 = !DIEnumerator(name: "__UIM_GROUP", value: 44)
!718 = !DIEnumerator(name: "__UIM_LOWER", value: 87)
!719 = !DIEnumerator(name: "__UIM_UPPER", value: 55)
!720 = !{!29, !6, !721, !722, !45, !724, !7, !725, !727, !677, !728, !729, !23, !730, !37, !82, !732, !80}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !18, line: 137, baseType: !723)
!723 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !18, line: 138, baseType: !10)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fpmax_t", file: !726, line: 26, baseType: !677)
!726 = !DIFile(filename: "./include/bits/uClibc_fpmax.h", directory: "/tmp/klee-uclibc-130")
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!734 = !{!598, !735}
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "prefix", scope: !600, file: !601, line: 1443, type: !737, isLocal: true, isDefinition: true)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 96, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 12)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 56, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 7)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "fmt", scope: !745, file: !746, line: 102, type: !757, isLocal: true, isDefinition: true)
!745 = distinct !DICompileUnit(language: DW_LANG_C99, file: !746, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !747, globals: !750, splitDebugInlining: false, nameTableKind: None)
!746 = !DIFile(filename: "libc/stdio/_fpmaxtostr.c", directory: "/tmp/klee-uclibc-130")
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !18, line: 122, baseType: !723)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !18, line: 109, baseType: !10)
!750 = !{!743, !751}
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "exp10_table", scope: !745, file: !746, line: 116, type: !753, isLocal: true, isDefinition: true)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !754, size: 1664, elements: !755)
!754 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !725)
!755 = !{!756}
!756 = !DISubrange(count: 13)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 160, elements: !486)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "invalid_mbs", scope: !760, file: !601, line: 533, type: !820, isLocal: true, isDefinition: true)
!760 = distinct !DISubprogram(name: "_ppfs_init", scope: !601, file: !601, line: 515, type: !761, scopeLine: 516, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !804, retainedNodes: !4)
!761 = !DISubroutineType(types: !762)
!762 = !{!45, !763, !29}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "ppfs_t", file: !601, line: 419, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !601, line: 400, size: 2048, elements: !766)
!766 = !{!767, !768, !776, !777, !778, !779, !780, !781, !792}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "fmtpos", scope: !765, file: !601, line: 401, baseType: !29, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !765, file: !601, line: 402, baseType: !769, size: 160, offset: 64)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "printf_info", file: !635, line: 55, size: 160, elements: !770)
!770 = !{!771, !772, !773, !774, !775}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !769, file: !635, line: 57, baseType: !45, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !769, file: !635, line: 58, baseType: !45, size: 32, offset: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !769, file: !635, line: 60, baseType: !193, size: 32, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !769, file: !635, line: 107, baseType: !58, size: 32, offset: 96)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !769, file: !635, line: 141, baseType: !193, size: 32, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "maxposarg", scope: !765, file: !601, line: 404, baseType: !45, size: 32, offset: 224)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "num_data_args", scope: !765, file: !601, line: 406, baseType: !45, size: 32, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "conv_num", scope: !765, file: !601, line: 407, baseType: !58, size: 32, offset: 288)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "argnumber", scope: !765, file: !601, line: 408, baseType: !646, size: 32, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "argtype", scope: !765, file: !601, line: 409, baseType: !648, size: 288, offset: 352)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !765, file: !601, line: 410, baseType: !782, size: 192, offset: 640)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !653, line: 14, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !784, baseType: !785)
!784 = !DIFile(filename: "libc/stdio/_ppfs_init.c", directory: "/tmp/klee-uclibc-130")
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !786, size: 192, elements: !663)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !787)
!787 = !{!788, !789, !790, !791}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !786, file: !784, baseType: !58, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !786, file: !784, baseType: !58, size: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !786, file: !784, baseType: !6, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !786, file: !784, baseType: !6, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "argvalue", scope: !765, file: !601, line: 417, baseType: !793, size: 1152, offset: 896)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 1152, elements: !649)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "argvalue_t", file: !601, line: 394, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !601, line: 382, size: 128, elements: !796)
!796 = !{!797, !798, !799, !800, !801, !802, !803}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "wc", scope: !795, file: !601, line: 383, baseType: !193, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !795, file: !601, line: 384, baseType: !58, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ul", scope: !795, file: !601, line: 385, baseType: !10, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ull", scope: !795, file: !601, line: 387, baseType: !25, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !795, file: !601, line: 390, baseType: !675, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ld", scope: !795, file: !601, line: 391, baseType: !677, size: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !795, file: !601, line: 393, baseType: !6, size: 64)
!804 = distinct !DICompileUnit(language: DW_LANG_C99, file: !784, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !805, retainedTypes: !818, globals: !819, splitDebugInlining: false, nameTableKind: None)
!805 = !{!56, !806}
!806 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !635, line: 206, baseType: !58, size: 32, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813, !814, !815, !816, !817}
!808 = !DIEnumerator(name: "PA_INT", value: 0)
!809 = !DIEnumerator(name: "PA_CHAR", value: 1)
!810 = !DIEnumerator(name: "PA_WCHAR", value: 2)
!811 = !DIEnumerator(name: "PA_STRING", value: 3)
!812 = !DIEnumerator(name: "PA_WSTRING", value: 4)
!813 = !DIEnumerator(name: "PA_POINTER", value: 5)
!814 = !DIEnumerator(name: "PA_FLOAT", value: 6)
!815 = !DIEnumerator(name: "PA_DOUBLE", value: 7)
!816 = !DIEnumerator(name: "__PA_NOARG", value: 8)
!817 = !DIEnumerator(name: "PA_LAST", value: 9)
!818 = !{!23}
!819 = !{!758}
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 264, elements: !821)
!821 = !{!822}
!822 = !DISubrange(count: 33)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "spec_flags", scope: !825, file: !601, line: 861, type: !908, isLocal: true, isDefinition: true)
!825 = distinct !DISubprogram(name: "_ppfs_parsespec", scope: !601, file: !601, line: 844, type: !826, scopeLine: 845, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !869, retainedNodes: !4)
!826 = !DISubroutineType(types: !827)
!827 = !{!45, !828}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "ppfs_t", file: !601, line: 419, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !601, line: 400, size: 2048, elements: !831)
!831 = !{!832, !833, !841, !842, !843, !844, !845, !846, !857}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "fmtpos", scope: !830, file: !601, line: 401, baseType: !29, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !830, file: !601, line: 402, baseType: !834, size: 160, offset: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "printf_info", file: !635, line: 55, size: 160, elements: !835)
!835 = !{!836, !837, !838, !839, !840}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !834, file: !635, line: 57, baseType: !45, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !834, file: !635, line: 58, baseType: !45, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !834, file: !635, line: 60, baseType: !193, size: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !834, file: !635, line: 107, baseType: !58, size: 32, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !834, file: !635, line: 141, baseType: !193, size: 32, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "maxposarg", scope: !830, file: !601, line: 404, baseType: !45, size: 32, offset: 224)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "num_data_args", scope: !830, file: !601, line: 406, baseType: !45, size: 32, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "conv_num", scope: !830, file: !601, line: 407, baseType: !58, size: 32, offset: 288)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "argnumber", scope: !830, file: !601, line: 408, baseType: !646, size: 32, offset: 320)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "argtype", scope: !830, file: !601, line: 409, baseType: !648, size: 288, offset: 352)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !830, file: !601, line: 410, baseType: !847, size: 192, offset: 640)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !653, line: 14, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !849, baseType: !850)
!849 = !DIFile(filename: "libc/stdio/_ppfs_parsespec.c", directory: "/tmp/klee-uclibc-130")
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 192, elements: !663)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !852)
!852 = !{!853, !854, !855, !856}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !851, file: !849, baseType: !58, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !851, file: !849, baseType: !58, size: 32, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !851, file: !849, baseType: !6, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !851, file: !849, baseType: !6, size: 64, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "argvalue", scope: !830, file: !601, line: 417, baseType: !858, size: 1152, offset: 896)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !859, size: 1152, elements: !649)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "argvalue_t", file: !601, line: 394, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !601, line: 382, size: 128, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "wc", scope: !860, file: !601, line: 383, baseType: !193, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !860, file: !601, line: 384, baseType: !58, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ul", scope: !860, file: !601, line: 385, baseType: !10, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ull", scope: !860, file: !601, line: 387, baseType: !25, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !860, file: !601, line: 390, baseType: !675, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ld", scope: !860, file: !601, line: 391, baseType: !677, size: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !860, file: !601, line: 393, baseType: !6, size: 64)
!869 = distinct !DICompileUnit(language: DW_LANG_C99, file: !849, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !870, retainedTypes: !881, globals: !883, splitDebugInlining: false, nameTableKind: None)
!870 = !{!806, !871, !63, !690}
!871 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !601, line: 237, baseType: !58, size: 32, elements: !872)
!872 = !{!873, !874, !875, !876, !877, !878, !879, !880}
!873 = !DIEnumerator(name: "FLAG_SPACE", value: 1)
!874 = !DIEnumerator(name: "FLAG_PLUS", value: 2)
!875 = !DIEnumerator(name: "FLAG_ZERO", value: 4)
!876 = !DIEnumerator(name: "FLAG_MINUS", value: 8)
!877 = !DIEnumerator(name: "FLAG_HASH", value: 16)
!878 = !DIEnumerator(name: "FLAG_THOUSANDS", value: 32)
!879 = !DIEnumerator(name: "FLAG_I18N", value: 64)
!880 = !DIEnumerator(name: "FLAG_WIDESTREAM", value: 128)
!881 = !{!8, !882, !45, !143, !29, !730}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!883 = !{!823, !884, !889, !892, !898, !900, !902, !905}
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "spec_chars", scope: !825, file: !601, line: 862, type: !886, isLocal: true, isDefinition: true)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 168, elements: !887)
!887 = !{!888}
!888 = !DISubrange(count: 21)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "spec_ranges", scope: !825, file: !601, line: 863, type: !891, isLocal: true, isDefinition: true)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 72, elements: !649)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "spec_or_mask", scope: !825, file: !601, line: 864, type: !894, isLocal: true, isDefinition: true)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 128, elements: !896)
!895 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!896 = !{!897}
!897 = !DISubrange(count: 8)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "spec_and_mask", scope: !825, file: !601, line: 865, type: !894, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "qual_chars", scope: !825, file: !601, line: 866, type: !757, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "type_codes", scope: !869, file: !601, line: 759, type: !904, isLocal: true, isDefinition: true)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 192, elements: !738)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "type_sizes", scope: !869, file: !601, line: 777, type: !907, isLocal: true, isDefinition: true)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 96, elements: !738)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 64, elements: !896)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(name: "invalid_wcs", scope: !911, file: !601, line: 1339, type: !996, isLocal: true, isDefinition: true)
!911 = distinct !DISubprogram(name: "_ppwfs_init", scope: !601, file: !601, line: 1337, type: !912, scopeLine: 1338, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !955, retainedNodes: !4)
!912 = !DISubroutineType(types: !913)
!913 = !{!45, !914, !730}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "ppfs_t", file: !601, line: 419, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !601, line: 400, size: 2048, elements: !917)
!917 = !{!918, !919, !927, !928, !929, !930, !931, !932, !943}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "fmtpos", scope: !916, file: !601, line: 401, baseType: !29, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !916, file: !601, line: 402, baseType: !920, size: 160, offset: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "printf_info", file: !635, line: 55, size: 160, elements: !921)
!921 = !{!922, !923, !924, !925, !926}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !920, file: !635, line: 57, baseType: !45, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !920, file: !635, line: 58, baseType: !45, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !920, file: !635, line: 60, baseType: !193, size: 32, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !920, file: !635, line: 107, baseType: !58, size: 32, offset: 96)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !920, file: !635, line: 141, baseType: !193, size: 32, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "maxposarg", scope: !916, file: !601, line: 404, baseType: !45, size: 32, offset: 224)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "num_data_args", scope: !916, file: !601, line: 406, baseType: !45, size: 32, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "conv_num", scope: !916, file: !601, line: 407, baseType: !58, size: 32, offset: 288)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "argnumber", scope: !916, file: !601, line: 408, baseType: !646, size: 32, offset: 320)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "argtype", scope: !916, file: !601, line: 409, baseType: !648, size: 288, offset: 352)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !916, file: !601, line: 410, baseType: !933, size: 192, offset: 640)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !653, line: 14, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !935, baseType: !936)
!935 = !DIFile(filename: "libc/stdio/vfwprintf.c", directory: "/tmp/klee-uclibc-130")
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 192, elements: !663)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !938)
!938 = !{!939, !940, !941, !942}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !937, file: !935, baseType: !58, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !937, file: !935, baseType: !58, size: 32, offset: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !937, file: !935, baseType: !6, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !937, file: !935, baseType: !6, size: 64, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "argvalue", scope: !916, file: !601, line: 417, baseType: !944, size: 1152, offset: 896)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 1152, elements: !649)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "argvalue_t", file: !601, line: 394, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !601, line: 382, size: 128, elements: !947)
!947 = !{!948, !949, !950, !951, !952, !953, !954}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "wc", scope: !946, file: !601, line: 383, baseType: !193, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !946, file: !601, line: 384, baseType: !58, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ul", scope: !946, file: !601, line: 385, baseType: !10, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ull", scope: !946, file: !601, line: 387, baseType: !25, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !946, file: !601, line: 390, baseType: !675, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ld", scope: !946, file: !601, line: 391, baseType: !677, size: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !946, file: !601, line: 393, baseType: !6, size: 64)
!955 = distinct !DICompileUnit(language: DW_LANG_C99, file: !935, producer: "Ubuntu clang version 13.0.1-2ubuntu2.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !956, retainedTypes: !985, globals: !990, splitDebugInlining: false, nameTableKind: None)
!956 = !{!871, !806, !957, !690, !713}
!957 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !958, file: !601, line: 1448, baseType: !58, size: 32, elements: !683)
!958 = distinct !DISubprogram(name: "_do_one_spec", scope: !601, file: !601, line: 1438, type: !959, scopeLine: 1440, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !955, retainedNodes: !4)
!959 = !DISubroutineType(types: !960)
!960 = !{!45, !961, !914, !679}
!961 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !340, line: 46, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !342, line: 233, size: 704, elements: !965)
!965 = !{!966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !977, !978, !984}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !964, file: !342, line: 234, baseType: !86, size: 16)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !964, file: !342, line: 237, baseType: !346, size: 16, offset: 16)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !964, file: !342, line: 244, baseType: !45, size: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !964, file: !342, line: 246, baseType: !88, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !964, file: !342, line: 247, baseType: !88, size: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !964, file: !342, line: 248, baseType: !88, size: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !964, file: !342, line: 249, baseType: !88, size: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !964, file: !342, line: 252, baseType: !88, size: 64, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !964, file: !342, line: 255, baseType: !88, size: 64, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !964, file: !342, line: 261, baseType: !976, size: 64, offset: 448)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !964, file: !342, line: 268, baseType: !359, size: 64, offset: 512)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !964, file: !342, line: 271, baseType: !979, size: 64, offset: 576)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !362, line: 85, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !362, line: 81, size: 64, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !980, file: !362, line: 83, baseType: !193, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !980, file: !362, line: 84, baseType: !193, size: 32, offset: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !964, file: !342, line: 274, baseType: !6, size: 64, offset: 640)
!985 = !{!730, !29, !23, !6, !721, !722, !45, !724, !7, !725, !727, !677, !728, !986, !193, !987, !37, !882, !82, !732}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !24, line: 116, baseType: !58)
!990 = !{!909, !991, !993}
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(name: "spec_base", scope: !958, file: !601, line: 1441, type: !740, isLocal: true, isDefinition: true)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(name: "prefix", scope: !958, file: !601, line: 1446, type: !995, isLocal: true, isDefinition: true)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 384, elements: !738)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 896, elements: !453)
